[
    { "text": "Your project update meeting is scheduled for next Monday at 2pm.", "category": "Work" },
    { "text": "Family vacation plans for the summer are now finalized. Check out the itinerary attached.", "category": "Personal" },
    { "text": "Special offer! Get 50% off on all electronics this weekend. Shop now!", "category": "Promotions" },
    { "text": "Join us on Facebook for the latest news and updates from our community.", "category": "Social" },
    { "text": "Important: Your bank account has been accessed from a new device. Verify your identity immediately.", "category": "Finance" },
    { "text": "Your flight to New York has been confirmed. Here are your travel details.", "category": "Travel" },
    { "text": "Enrollment is now open for the summer coding boot camp. Sign up today!", "category": "Education" },
    { "text": "Don't miss our latest newsletter with tips on improving productivity at work.", "category": "Updates" },
    { "text": "Need help with your recent purchase? Contact our support team for assistance.", "category": "Support" },
    { "text": "Invitation to a community event this Friday. RSVP if you plan to attend.", "category": "Social" },
    { "text": "Your subscription to the magazine will expire soon. Renew now to continue receiving issues.", "category": "Updates" },
    { "text": "Your account has been upgraded to a premium membership. Enjoy the new features!", "category": "Promotions" },
    { "text": "Check out our new blog post on effective strategies for work-life balance.", "category": "Work" },
    { "text": "We have received your application for the scholarship program. You will hear back soon.", "category": "Education" },
    { "text": "Reminder: Your car insurance policy is due for renewal next week. Please review the terms.", "category": "Finance" },
    { "text": "Congratulations! You have won a $100 gift card to your favorite store.", "category": "Promotions" },
    { "text": "We are moving our office to a new location next month. Here is the new address and directions.", "category": "Work" },
    { "text": "Invitation to a family reunion party next weekend. Bring your favorite dish!", "category": "Personal" },
    { "text": "Limited time offer: Get a free trial of our new software tool.", "category": "Promotions" },
    { "text": "Update your contact information to stay informed about upcoming events and news.", "category": "Updates" },
    { "text": "Need immediate assistance? Our support team is available 24/7 to help you.", "category": "Support" },
    { "text": "Your online course has been successfully enrolled. Check your dashboard for the schedule.", "category": "Education" },
    { "text": "Security alert: Unusual activity detected on your account. Please review recent transactions.", "category": "Finance" },
    { "text": "Follow us on Twitter for the latest updates and special offers.", "category": "Social" },
    { "text": "Your order has been shipped and will arrive in 3-5 business days. Track your package here.", "category": "Updates" },
    { "text": "Reminder: Your dentist appointment is scheduled for next Wednesday at 3pm.", "category": "Personal" },
    { "text": "Sign up for our free webinar on digital marketing strategies. Seats are limited.", "category": "Education" },
    { "text": "New promotion on home appliances: Save up to 30% on selected items.", "category": "Promotions" },
    { "text": "Your new credit card statement is available. Review it online or contact customer service for details.", "category": "Finance" },
    { "text": "Follow the latest updates on our blog about industry trends and insights.", "category": "Work" },
    { "text": "Community event: Join us for a charity run this Saturday. All proceeds go to local shelters.", "category": "Social" },
    { "text": "Your magazine subscription has been successfully renewed for another year.", "category": "Updates" },
    { "text": "The technical support team is here to help with any issues you're facing with the software.", "category": "Support" },
    { "text": "Special offer on fitness gear: Get 20% off on all purchases this month.", "category": "Promotions" },
    { "text": "Your university application has been received. You will be notified about the next steps soon.", "category": "Education" },
    { "text": "Your online purchase was successful. Here are the details of your order.", "category": "Updates" },
    { "text": "Invitation to a wedding reception next month. RSVP by the end of the week.", "category": "Personal" },
    { "text": "Your business account has been updated with new features. Check them out today.", "category": "Work" },
    { "text": "The annual financial report is now available for review. Access it through your account.", "category": "Finance" },
    { "text": "New blog post: Tips for effective remote working and managing your home office.", "category": "Work" },
    { "text": "Summer sale: Save up to 40% on outdoor furniture and home decor items.", "category": "Promotions" }
  ]
  